<a href="https://colab.research.google.com/github/spasatel13/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module1-exploratory-data-analysis/Philipp_Libenson_DS21_S1M1_Exploratory_Data_Analysis_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Learning Objectives

# Exploratory Data Analysis

- Objective 01 - submit assignments and save work via GitHub
- Objective 02 - load a CSV dataset from a URL using `pandas.read_csv`
- Objective 03 - load a CSV dataset from a local file using `pandas.read_csv
- Objective 04 - use basic Pandas functions for Exploratory Data Analysis-EDA
- Objective 05 - describe and discriminate between basic data types such as categorical, quantitative, continuous, discrete, ordinal, nominal and identifier

#Explore the University of California - Irvine Adult Dataset

###1) Load a dataset via its URL.

Load the Adult dataset from: 'https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data'

Specify the column headers as:'age', 'workclass', 'fnlwgt', 'education', 'education-num', 'marital-status', 'occupation', 'relationship', 'race', 'sex', 'capital-gain', 'capital-loss', 'hours-per-week','native-country', 'income']

In [ ]:
#Code here
import pandas as pd
dfAdult=pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', skipinitialspace=True)
column_headers = ['age', 'workclass', 'fnlwgt', 'education', 'education-num', 
                 'marital-status', 'occupation', 'relationship', 'race', 'sex', 
                 'capital-gain',  'capital-loss', 'hours-per-week', 
                 'native-country', 'income']
dfAdult.columns=column_headers

###2) Print the first 5 and the last 5 rows.

In [ ]:
#Code here
dfAdult.head()

   age         workclass  fnlwgt  ... hours-per-week  native-country income
0   50  Self-emp-not-inc   83311  ...             13   United-States  <=50K
1   38           Private  215646  ...             40   United-States  <=50K
2   53           Private  234721  ...             40   United-States  <=50K
3   28           Private  338409  ...             40            Cuba  <=50K
4   37           Private  284582  ...             40   United-States  <=50K

[5 rows x 15 columns]

In [ ]:
#Code here
dfAdult.tail()

       age      workclass  fnlwgt  ... hours-per-week  native-country  income
32555   27        Private  257302  ...             38   United-States   <=50K
32556   40        Private  154374  ...             40   United-States    >50K
32557   58        Private  151910  ...             40   United-States   <=50K
32558   22        Private  201490  ...             20   United-States   <=50K
32559   52   Self-emp-inc  287927  ...             40   United-States    >50K

[5 rows x 15 columns]

###3) Determine the data type of each varaible.

In [ ]:
#Code here
age: Quantative, continous
workclass: Categorical, nominal
fnlwgt: Quantative, continous
education: Categorical, nominal
marital-status: Categorical, nominal
occupation Categorical, nominal
relationship: Categorical, nominal
race: Categorical, nominal
sex: Categorical, nominal
capital-gain: Quantative, discrete 
capital-loss: Quantative, discrete
hours-per-week: Quantative, continous
native-country: Categorical, nominal
income: Categorical, nominal

###4) Determine the dimensions of the dataset.

In [ ]:
#Code here
dfAdult.shape

(32560, 15)

###5) Are there any missing values in the dataset?
Check for missing values using .isnull().sum().

In [ ]:
#Code here
dfAdult.isna().sum()

age               0
workclass         0
fnlwgt            0
education         0
education-num     0
marital-status    0
occupation        0
relationship      0
race              0
sex               0
capital-gain      0
capital-loss      0
hours-per-week    0
native-country    0
income            0
dtype: int64

###6) Use the .describe() function in order to see the summary statistics of the numeric columns.

Are there any values shown that might be a code for missing data?  We'll learn how to change the values in a DataFrame tomorrow.

In [ ]:
#Code here
dfAdult.describe()

                age        fnlwgt  ...  capital-loss  hours-per-week
count  32560.000000  3.256000e+04  ...  32560.000000    32560.000000
mean      38.581634  1.897818e+05  ...     87.306511       40.437469
std       13.640642  1.055498e+05  ...    402.966116       12.347618
min       17.000000  1.228500e+04  ...      0.000000        1.000000
25%       28.000000  1.178315e+05  ...      0.000000       40.000000
50%       37.000000  1.783630e+05  ...      0.000000       40.000000
75%       48.000000  2.370545e+05  ...      0.000000       45.000000
max       90.000000  1.484705e+06  ...   4356.000000       99.000000

[8 rows x 6 columns]

Answer question here.

I would guess that 999999 in capital gains stants for missing data.\
Also, 99 hours per week is probably a stand-in for missing values.

###7) Use the .describe(exclude='number') function to calculate summary statistics for the non-numeric columns

In [ ]:
#Code here
dfAdult.describe(exclude='number')

       workclass education      marital-status  ...    sex native-country income
count      32560     32560               32560  ...  32560          32560  32560
unique         9        16                   7  ...      2             42      2
top      Private   HS-grad  Married-civ-spouse  ...   Male  United-States  <=50K
freq       22696     10501               14976  ...  21789          29169  24719

[4 rows x 9 columns]

###8) Calculate the number of observations in each category of the relationship variable.

In [ ]:
#Code here
dfAdult['relationship'].value_counts()

Husband           13193
Not-in-family      8304
Own-child          5068
Unmarried          3446
Wife               1568
Other-relative      981
Name: relationship, dtype: int64

###9) Select and print the occupation category.

In [ ]:
#Code here
dfAdult['occupation']

0          Exec-managerial
1        Handlers-cleaners
2        Handlers-cleaners
3           Prof-specialty
4          Exec-managerial
               ...
32555         Tech-support
32556    Machine-op-inspct
32557         Adm-clerical
32558         Adm-clerical
32559      Exec-managerial
Name: occupation, Length: 32560, dtype: object

#Load a dataset saved on your personal computer

Go to the website http://users.stat.ufl.edu/~winner/datasets.html and scroll down to **NASCAR Race Results by Driver 1975-2003**

Download and save the .csv file to your personal computer.

###10) Upload the dataset using the following commands.

In [ ]:
from google.colab import files
uploaded = files.upload()

Saving nascard.csv to nascard.csv

In [ ]:
#Code here
dfAdult2=pd.read_csv('nascard.csv')

###11) Print the first 10 rows of the dataset

In [ ]:
#Code here
dfAdult2.head(10)

   serRace  year  yearRace  finish  ...  prize  carsRace    carMake          driver
0        1  1975         1       1  ...  12035        35    Matador    BobbyAllison
1        1  1975         1       2  ...   8135        35    Mercury    DavidPearson
2        1  1975         1       3  ...   6535        35  Chevrolet     CecilGordon
3        1  1975         1       4  ...   5035        35      Dodge      DaveMarcis
4        1  1975         1       5  ...   3835        35       Ford     ElmoLangley
5        1  1975         1       6  ...   2885        35  Chevrolet     JamesHylton
6        1  1975         1       7  ...   3185        35      Dodge    RichardPetty
7        1  1975         1       8  ...   2485        35  Chevrolet    GaryMatthews
8        1  1975         1       9  ...   2335        35      Dodge         EdNegre
9        1  1975         1      10  ...   2185        35  Chevrolet  HershelMcGriff

[10 rows x 10 columns]

###12) Answer the following questions for the variables prize, carMake and driver:


*   Is the variable categorical or quantitative?
*   If the variable is categorical, determine if it is ordinal, nominal or an identifier variable.
*   If the vriable is quantitative, determine if it is continuous or discrite.

#Answer here.

prize: Quantative, discrete\
carMaker: Categorical, nominal\
driver: Categorical,  identifier variable

#Data Storytelling Project Milestone

Begin looking at Data Storytelling (previously called Build Week) [project info](https://github.com/LambdaSchool/DS-Unit-1-Build) and at projects created by previous Lambda students.

[Projects — Lambda DS1!](https://drive.google.com/file/d/1RJoAqDgawzSHOJPlDQRRlfz-EnIsskpL/view)